const express = require('express');
const app = express();
const PORT = 8000;
const cors = require('cors')


app.use(cors());
app.use(express.json());

const products = [
  {
    name: 'แครอท Carrot',
    image: 'https://www.tcc-chaokoh.com/uploads/filemanager/Cooking%20Club/Nutrition/Carrot.jpg',
    benefit: '<br>1.มีเส้นใยสูงช่วยในระบบขับถ่าย<br>2.มีสารต้านอนุมูลอิสระช่วยป้องกันโรคมะเร็งได้เป็นอย่างดี<br>3.ช่วยลดคอเสเตอรอล ทำให้ระบบไหลเวียนเลือดทำงานได้ดีขึ้น',
    plant: '<br>1.หยอดเมล็ดลงหลุม หลุมละ 3-4 เมล็ด ระยะปลูก 20 x 20 เซ็นติเมตร<br>2.แครอทจะเริ่มงอกให้เห็นภายใน 1 สัปดาห์<br>3.เมื่อปลูกได้ 1 เดือน ถอนแยกให้เหลือหลุมละ 1 ต้น 4.ใส่ปุ๋ยหมักหรือปุ๋ยคอก เมื่ออายุได้ 45 วัน แครอทจะเริ่มลงหัว ก็จะใส่ปุ๋ยอีกครั้ง'
  },
  {
    name: 'มะเขือเทศ Tomato',
    image: 'https://www.thaihealth.or.th/data/content/26492/cms/e_fimorx123489.jpg',
    benefit: '<br>1.ช่วยบำรุงผิวพรรณให้ชุ่มชื่นสดใส ไม่แห้งกร้าน<br>2.มีสารต่อต้านอนุมูลอิสระที่ช่วยลดและชะลอการเกิดริ้วรัยแห่งวัย<br>3.มีวิตามินเอซึ่งมีส่วนชวยบำรุงสายตา',
    plant: '<br>1.ทำการเตรียมดินสำเร็จรูปที่มีส่วนผสมของปุ๋ยคอกใส่กระถางขนาดประมาณ 6-11 นิ้วขึ้นไป<br>2.นำต้นกล้าที่จะแยกปลูกมาแล้วใช้ไม้ลูกชิ้นอันเล็กๆเสียบเข้าไปที่รูของก้นกระบะเพาะชำเพื่อที่จะดันต้นกล้ามะเขือเทศออกมา<br>3.นำต้นกล้าลงปลูกในกระถางที่เตรียมไว้และใส่ดินลงไปให้เต็ม<br>4.ให้น้ำและนำไปวางในบริเวณที่มีแสงทั้งวัน'
  },
  {
    name: 'กะหล่ำปลี Cabbage',
    image: 'https://mono29.com/app/uploads/2022/12/cabbage-1666765_960_720.jpg',
    benefit: '<br>1.บำรุงกระดูก และฟัน เพราะกะหล่ำปลีมีแคลเซียม และฟอสฟอรัส<br>2.เสริมสร้างภูมิคุ้มกันของร่างกาย ป้องกันหวัด<br>3.ช่วยบรรเทาอาการของโรคกระเพาะอักเสบ',
    plant: '<br>1.นำดินเพาะเมล็ดที่เตรียมไว้มาเทลงใส่ใน ถาดเพาะหรือถุงเพาะ กะเอาพอประมาณ ไม่ต้องล้น<br>2.หยอดเมล็ด กะหล่ำปีลงไปในแต่ละหลุม จากนั้น ตักดินมากลบเมล็ด แล้วรดน้ำตามให้ชุ่ม<br>3.รอระยะเวลาที่ ต้นอ่อนจะงอกขึ้นมาจากเมล็ด<br>4.การเติมสารอาหาร สามารถให้ได้ ตั้งแต่ต้นอ่อนมีอายุประมาร 15 วัน'
  },
  {
    name: 'แรดิช Radish',
    image: 'https://hkm.hrdi.or.th/upload/images/Uploads/Images/Veg/%E0%B8%95%E0%B8%A3%E0%B8%B0%E0%B8%81%E0%B8%B9%E0%B8%A5%E0%B8%81%E0%B8%B0%E0%B8%AB%E0%B8%A5%E0%B9%88%E0%B8%B3/%E0%B9%81%E0%B8%A3%E0%B8%94%E0%B8%B4%E0%B8%8A/IMG_2862.jpg',
    benefit: '<br>1.ดูแลโรคทางเดินหายใจ เพราะมีส่วนช่วยป้องกันหวัดและทางเดินหายใจอักเสบ<br>2.ช่วยขับเสมหะ<br>3.ช่วยป้องกันเลือดออกตามไรฟันได้',
    plant: '<br>1.ขุดดินตากแดดทิ้งไว้อย่างน้อย 14 วัน ควรเก็บหญ้าออกทิ้ง <br>2.ขึ้นแปลงกว้าง 1 เมตร ย่อยดินให้ละเอียดใส่ปุ๋ย 12-24-12 อัตรา 30 กรัม/ตร.ม. ใส่ปุ๋ยคอกอัตรา 1 กก./ตร.ม. และโบแรกซ์ อัตรา 1 กรัม/ตร.ม.<br>3.คลุกดินให้เข้ากัน กรีดร่องขวางแปลงห่างกัน 15 ซม. หยอดเมล็ด ในร่องระยะ 3-5 ซม. กลบดินรดน้ำให้ชุ่ม'
  },
  {
    name: 'กระเทียม Garlic',
    inmage: 'https://static.thairath.co.th/media/dFQROr7oWzulq5Fa4VRUgrz81A4z01WwRMrshhgAifQSZp14rV8A4v8rASKxA231AOW.jpg',
    benefit: '<br>1.แก้ปัญหาผมหลุดร่วง <br>2.ป้องกันและรักษาโรคหวัด<br>3.ไล่ยุงและแมลงสัตว์กัดต่อย',
    plant: '<br>1. เตรียมแปลงกว้างประมาณ 1.20 เมตร ความยาวตามสภาพพื้นที่ ความสูงของแปลงประมาณ 20 เซนติเมตร <br>2.ฝั่งกลีบกระเทียมหลุมละ 1 กลีบ ลึกประมาณ 1 เซนติเมตร<br>3. ให้รดน้ำอย่างสมํ่าเสมอ ประมาณ 5-7 วัน/ครั้ง'
  },
  {
    name: 'ฟักทอง Pumpkin',
    image: 'https://www.thaihealth.or.th/data/content/29468/cms/thaihealth_c_cfimpqrtyz29.jpg',
    benefit: '<br>1.มีสารต้านอนุมูลอิสระ ทีช่วยลดความเสี่ยงในการเป็นโรคมะเร็ง<br>2.บำรุงผิวพรรณให้เต่งตึง ชุ่มชื่น ชะลอรอยเหี่ยวย่น<br>3.เสริมสร้างระบบภูมิคุ้มกันให้กับร่างกาย',
    plant: '<br>1.ขุดหลุมเล็ก ๆ ลงไปในดินประมาณ 2.5-5 เซนติเมตร รองก้นหลุมด้วยปุ๋ยคอกหรือปุ๋ยหมักที่สลายตัวดีแล้ว<br>2.หยอดเมล็ดฟักทองลงไปหลุมละ 3-5 เมล็ด<br>3.กลบด้วยดินผสมละเอียด หรือขี้เถ้าแกลบดำ<br>4.รดน้ำให้ชุ่ม คลุมด้วยฟางเพื่อรักษาความชุ่มชื้นของผิวหน้าดิน<br>5.ภายใน 3-4 วัน ต้นกล้าจะงอกพ้นพื้นดิน มีใบจริง 2-3 ใบ ให้ถอนต้นกล้าที่อ่อนแอทิ้งไป ให้เหลือหลุมละ 1 ต้นเท่านั้น'
  },
  {
    name: 'แตงกวา Cucumber',
    image: 'https://www.innnews.co.th/wp-content/uploads/2022/07/%E0%B9%81%E0%B8%95%E0%B8%87%E0%B8%81%E0%B8%A7%E0%B8%B2.png',
    benefit: '<br>1.แตงกวามีสรรพคุณช่วยแก้กระหาย ลดความร้อนในร่างกาย ทำให้ร่างกายสดชื่น และช่วยเพิ่มความชุ่มชื้น<br>2.ช่วยกำจัดของเสียที่ตกค้างในร่างกาย<br>3.แตงกวามีสารฟีนอลที่ทำหน้าที่ต่อต้านอนุมูลอิสระต่าง ๆ',
    plant: '<br>1.ไถแปลงและเตรียมดินตากแดดไว้ประมาณ 7 วัน เพื่อทำลายวัชพืชและศัตรูพืชบางชนิดที่อยู่ในดิน<br>2.วัดระยะแถว 1 เมตร และระยะระหว่างต้นประมาณ 1 เมตร<br>3.ขุดหลุม แล้วหยอดเมล็ดลงหลุม 3-4 เมล็ด<br>4.จากนั้นกลบหน้าดินด้วยปุ๋ยคอกและแกลบ รดน้ำให้ชุ่ม<br>5.เมื่อต้นแตงกวาแตกใบ 3-4 ใบ ให้ปักไม้ค้างเพื่อให้เถาเลื้อยเกาะกับไม้ เริ่มใส่ปุ๋ยเคมีผสมกับปุ๋ยคอก จากนั้นรดน้ำเฉพาะตอนเช้า<br>6.เมื่อต้นแตงกว่าเจริญเติบโตมาได้ระยะหนึ่ง และเริ่มออกดอกออกผล ก็ทำการเร่งปุ๋ย รดน้ำทุกเช้าเย็น'
  },
  {
    name: 'บล็อคโคลี่ Broccoli',
    image: 'https://img-ha.mthcdn.com/osGlL2TME6yX-Qq6CaJ3I_WYL7A=/decor.mthai.com/app/uploads/2019/01/800_broccoli_17_01_2019.jpg',
    benefit: '<br>1.สารต้านอนุมูลอิสระสูง<br>2.ดีต่อสายตา<br>3.ช่วยให้ดูเด็ก',
    plant: '<br>1.นำต้นกล้าลงปลูกในร่องที่เตรียมไว้ ปลูกในระยะห่างระหว่างต้น 40 เซนติเมตร ระยะห่างระหว่างแถวที่ยกร่องไว้ 50-60 เซนติเมตร จากนั้น รดน้ำให้ชุ่ม<br>2.หลังการปลูกในระยะ 1 สัปดาห์แรก ควรให้น้ำทุกวัน วันละ 1 ครั้ง แล้วค่อยเพิ่มระยะห่างเป็นวันเว้นวัน และ 2-3 ครั้ง/อาทิตย์ และในระยะเริ่มออกดอก เพิ่มการให้น้ำเป็นวันละ 1 ครั้ง<br>3.การกำจัดวัชพืชหลังจากปลูกแล้ว ประมาณ 15 วัน ให้เริ่มกำจัดวัชพืช และกำจัดวัชพืชต่อเนื่องในทุกๆ 20 วัน<br>4.หลังจากปลูกบล็อกโคลี่แล้ว 5 วัน ให้ใส่ปุ๋ยเคมี'
  },
  {
    name: 'กะหล่ำม่วง Purple cabbage',
    image: 'https://mono29.com/app/uploads/2022/12/w02-1.jpg',
    benefit: '<br>1.ต้านอนุมูลอิสระ<br>2.บำรุงดวงตา<br>3.ลดความเสี่ยงในการเกิดโรคอัลไซเมอร์',
    plant:'<br>1.การเตรียมดิน นำดินไปตากแดดก่อนประมาณสัก 5-7 วัน หลังจากนั้นเมื่อได้ดินที่เตรียมไว้แล้ว นำไปผสมกับปุ๋ยคอกหรือปุ๋ยหมัก<br>2.ขุดหลุมเพื่อเตรียมการปลูก แล้วนำเมล็ดที่เราเตรียมไว้ใส่ลงไป<br>3.พอเข้าช่วง 4-6 สัปดาห์ เมื่อต้นกะหล่ำปลีที่เราปลูกไว้เริ่มเป็นต้นกล้า นำต้นกะหล่ำปลีนั้นย้ายลงในกระถาง'
  },
  {
    name: 'กะเพรา (Holy basil)',
    image: 'https://www.doctor.or.th/sites/default/files/jpg_27',
    benefit: '<br>1.	ใบกะเพราสด นำมาต้มให้เดือดและกรองเอาน้ำดื่ม  เป็นยาแก้ขับลม  ท้องอืด ท้องเฟ้อ ปวดท้อง บำรุงธาตุ ขับผายลม แก้อาการจุกเสียดในท้อง  ขับเสมหะ  ขับเหงื่อ หรือใช้ทาภายนอกแก้โรคผิวหนังได้  <br>2.   เมล็ด ใช้พอกบริเวณตา ทำให้ผง หรือฝุ่น ละอองที่เข้าตาออกมาโดยไม่ทำให้ตาช้ำ <br>3.   รากที่แห้งแล้ว นำมาชงหรือต้มกับน้ำร้อนดื่ม แก้โรคธาตุพิการ <br>4.   ใบสดขับไขมันและน้ำตาลส่วนเกินออกจากร่างกาย จึงเป็นเหตุผลที่ว่า ตำรับอาหารไทยส่วนใหญ่มัก       มีใบกะเพราเป็นส่วนผสมอยู่',
    plant: '<br>1. เตรียมแปลงปลูก ก่อนหว่านเมล็ดลงไป หรือเริ่มจากการปักชำก้านที่เหลือจากการซื้อมาทำกับข้าวก็ได้ <br>2. หลังเพาะประมาณ 7-10  วัน เมล็ดเริ่มงอก พอผ่านไป 15-30 วัน จึงเริ่มใส่ปุ๋ยยูเรีย หรือแอมโมเนียมซัลเฟต 1- 2 ช้อนชาต่อน้ำ 10 ลิตร รดทุก 5-7 วัน <br>3. สำหรับการรดน้ำ ให้รดน้ำอย่างเพียงพอและสม่ำเสมอทุกวัน หลังปลูกไปประมาณ 30-35 วันก็เก็บกินได้แล้ว <br>4. เคล็ดลับที่จะทำให้ต้นกะเพราเก็บกินใบได้นานคือ อย่าให้ออกดอกเมื่อออกดอกแล้วต้นจะโทรม อายุจะสั้น ถ้าออกดอกก็ให้หมั่นตัดทิ้งเป็นระยะ'
  },
  {
    name: 'โหระพา (basil)',
    image: 'https://www.doctor.or.th/sites/default/files/jpg_32',
    benefit: '<br>1.	ใบสด<br><br>-	แก้ท้องอืด ท้องเฟ้อ <br><br>-	ขับลมจากลำไส้ <br><br>-	ต้มดื่มแก้ลมวิงเวียน <br><br>-	ช่วยย่อยอาหาร <br><br>-	แก้หวัด <br><br>-	ขับเหงื่อ<br><br>-	ถ้าเด็กปวดท้อง ใช้ใบโหระพา 20 ใบ ชงน้ำร้อนและนำมาชงนมให้เด็กดื่มแทนยาขับลมได้ <br>2.	เมล็ดแก่ <br><br>-	นำมาแช่น้ำตำพอกหรือประคบแก้ไขข้ออักเสบ แผลอักเสบ <br><br>-	เป็นยาขับปัสสาวะ<br><br>-	เป็นยาระบายอ่อน ๆ เพื่อแก้อาการท้องผูก โดยนำเมล็ดแก่แช่น้ำให้พองตัวเต็มที่รับประทานกับขนมหวานโดยผสมกับน้ำหวานและน้ำแข็ง<br>3.	ใบโหระพาแห้งมาบดเป็นผง ใช้รักษาอาการเหงือกอักเสบเป็นหนองได้',
    plant: '<br>1.	โหระพาเป็นพืชที่ปลูกครั้งเดียวสามารถเก็บเกี่ยวได้ 1 - 2 ปี เริ่มจากการเตรียมดินควรมีความร่วนซุย มีการระบายน้ำดี <br>2.	เริ่มขั้นตอนการปลูกควรทำในเวลาเย็น วิธีการปลูกที่นิยมมี 2 วิธีด้วยกัน คือ <br><br>-	การปักชำ<br><br>-	การเพาะเมล็ด <br>3.	โหระพาเป็นพืชที่ต้องการความชื้นสูงและสม่ำเสมอ จึงควรมีการรดน้ำให้ทุกวัน แต่อย่าให้น้ำท่วมขัง<br>4.	ระยะแรกควรทำการพรวนดินและกำจัดพืชทุก ๆ 1 - 2 สัปดาห์ ถ้าจะใส่ปุ๋ยให้ใช้ปุ๋ยแอมโมเนียมซัลเฟต ในอัตรา 10 กิโลกรัมต่อไร่ ละลายน้ำรดหลังปลูกประมาณ 15 - 20 วัน ทำให้เจริญเติบโตดียิ่งขึ้น <br>5.	หลังจากปลูกประมาณ 30 - 35 วัน สามารถทำการเก็บเกี่ยวได้ <br>6.	ห้ามให้ออกดอก ตัดดอกทิ้งเรื่อย ๆ จะทำให้เก็บกินใบโหระพาได้นาน '
  },
  {
    name: 'ผักบุ้ง (Water spinach)',
    image: 'https://decor.mthai.com/app/uploads/2016/02/600_thumbnail_morning_glory_amarin.jpg',
    benefit: '<br>1.	สำหรับผักบุ้งที่ทานกันอยู่มี 2 ประเภท คือ <br><br>-	ผักบุ้งไทย ผักบุ้งไทยจะมีสรรพคุณทางยามากกว่าผักบุ้งอื่น<br><br><br>-	ผักบุ้งจีน จะมีแคลเซียม และเบต้า-แคโรทีน มากกว่า <br>2.	ส่วนที่ใช้ประโยชน์ของผักบุ้งไทยต้นขาวคือ ดอก ใบ ต้น และราก ซึ่งแต่ละส่วนจะให้สรรพคุณแตกต่างกัน ดังนี้<br><br>2.1	ดอก <br><br>- ใช้เป็นยาแก้กลากเกลื้อน<br><br>2.2	ต้นสด <br><br>- ใช้ดับพิษ รักษาแผลไฟไหม้ น้ำร้อนลวก  <br><br>- ลดอาการแพ้ อักเสบ <br><br>- บำรุงสายตา <br><br><br>- บำรุงเลือด <br><br><br>- บำรุงกระดูกและฟัน <br><br><br>- ช่วยรักษาโรคเบาหวาน <br><br><br>- เป็นยาดับร้อน <br><br><br>- แก้ปัสสาวะเหลือง<br><br>2.3	ทั้งต้น  <br><br><br>- ใช้แก้โรคประสาท ปวดศีรษะ อ่อนเพลีย <br><br><br>- แก้กลาก เกลื้อน <br><br><br>- แก้เบาหวาน  <br><br><br>- แก้ตาอักเสบ บำรุงสายตา <br><br><br>- แก้เหงือกบวม <br><br><br>- แก้ฟกช้ำ <br><br><br>- ถอนพิษ <br><br>2.4	ใบ <br><br><br>- ใช้ถอนพิษแมลงสัตว์กัดต่อย <br><br><br>- นำใบสดมาตำ แล้วคั้นเอาน้ำมาดื่ม จะทำให้อาเจียน <br><br><br>- ถอนพิษยาเบื่อเมา <br><br><br>- แก้พิษของฝิ่นและสารหนู <br><br><br>- มีวิตามินเอสูง เป็นสารต้านอนุมูลอิสระ<br><br>2.5	ราก <br><br><br>- ใช้แก้ไอเรื้อรังและแก้โรคหืด<br><br><br>- ถอนพิษผิดสำแดง <br><br><br>- แก้สตรีมีตกขาวมาก เบาขัด เหงื่อออกมาก <br><br><br>- ลดอาการบวม',
    plant: '<br>1.เริ่มจากการหว่านเมล็ด ต้นกล้าจะเริ่มงอก 2-3 วันหลังหยอดเมล็ด ผักบุ้งชอบดินที่มีความชื้นสูง ดั้งนั้น ควรให้น้ำบ่อย ๆ อย่าให้ขาดน้ำ เพราะผักบุ้งอาจจะชะงักการเจริญเติบโต แคระแกร็น และไม่จำเป็นต้องกำจัดศัตรูพืชเพราะเป็นผักที่มีอายุสั้นและเจริญเติบโตเร็วมาก สามารถขึ้นคลุมพื้นที่ได้อย่างรวดเร็ว<br>2.หลังจากหว่านเมล็ดประมาณ 25-30 วัน ก็สามารถเก็บเกี่ยวได้โดยใช้มือถอนทั้งราก<br>3.นำมาล้างให้สะอาด หรือหากไม่ถอน สามารถใช้มือเด็ดหรือมีดตัดยอดไปบริโภคและปล่อยโคนไว้'
  },
  {
    name: 'พริก (chili)',
    image: 'https://www.sgethai.com/wp-content/w3-webp/uploads/2023/02/13-14.jpgw3.webp',
    benefit: '<br>1มีสรรพคุณในทางการแพทย์ เช่น สารสำคัญที่มีในพริก คือ แคปไซซิน สามารถฆ่าเชื้อแบคทีเรียที่เป็นสาเหตุของการเกิดโรคกระเพาะอาหารได้<br>2.ช่วยลดการอุดตันของเส้นเลือด<br>3.	ลดการเสียชีวิตอันเนื่องมาจากเส้นเลือดที่ไปเลี้ยงสมองอุดตัน<br>4.ช่วยลดความเสี่ยงของการเกิดโรคมะเร็ง<br>5.เป็นพืชผักที่มีวิตามินซีสูง<br>6.สารแคปไซซินในพริกยังช่วยเสริมสร้างอารมณ์ให้ดีขึ้นได้ เนื่องจากสารตัวนี้เป็นสารที่มีส่วนในการส่งสัญญาณให้ต่อมใต้สมองสร้างสารเอนดอร์ฟินซึ่งมีคุณสมบัติบางประการที่สำคัญคล้ายมอร์ฟีน คือ บรรเทาอาการเจ็บปวด ในขณะเดียวกันก็ช่วยให้อารมณ์ดีขึ้น',
    plant: '<br>1.นำเมล็ดพริกไปหยอดในหลุมที่เตรียมไว้หลุมละ 3-5 เมล็ดกลบแล้วก็รดน้ำ สำหรับพริกเป็นพืชที่ทนแล้งดีกว่าทนน้ำ<br>2.ในระยะที่พริกเริ่มออกดอก  พริกจะต้องการน้ำมากกว่าปกติ ช่วง 3 วันแรกควรให้น้ำวันละ 2 ครั้งเช้า-เย็น และค่อย ๆ ลดลงเรื่อย ๆ จนผ่านไป 7 สัปดาห์ให้น้ำสัปดาห์ละ 1 ครั้ง  <br>3.พริกจะเริ่มให้ผลผลิตหลังจากปลูกแล้ว 2 เดือนครึ่งถึง 3 เดือน ในระยะแรกผลผลิตจะได้น้อยและจะค่อย ๆ เพิ่มมากขึ้นตามลำดับ ควรเก็บเกี่ยวอาทิตย์ละ 1 ครั้ง<br>4.ผลผลิตจะเริ่มลดลงเมื่อพริกเริ่มแก่'
  },
  {
    name: 'สะระแหน่(Peppermint)',
    image: 'https://mono29.com/app/uploads/2022/12/Peppermint.jpg',
    benefit: '<br>1.เป็นยาคลายความกดดันของกล้ามเนื้อที่เกิดจากความเหนื่อยล้าและความเครียด<br>2.น้ำมันสาระแหน่ช่วยขจัดลมร้อน ใช้เป็นยาดับร้อน ถอนพิษไข้ ขับลม ขับเหงื่อ รักษาอาการหวัดลมร้อน<br>3.รักษาอาการปวดศีรษะ หน้ามืดตาลาย ปวดฟัน เจ็บคอ เจ็บปาก เจ็บลิ้น โดยดื่มน้ำต้มใบสะระแหน่ 5 กรัม กับน้ำ 1 ถ้วย ผสมเกลือเล็กน้อย วันละ 2 ครั้ง<br>4.นำใบสะระแหน่ต้มดื่มแต่น้ำช่วยรักษาอาการปวดท้อง ท้องอืด ท้องเฟ้อ ช่วยขับลมในกระเพาะ บิด ท้องร่วง อุจจาระเป็นเลือด<br>5.แก้พิษแมลงสัตว์กัดต่อย โดยตำใบสะระแหน่ให้ละเอียด พอกบริเวณที่โดนกัด<br>6.ช่วยห้ามเลือดกำเดาได้ โดยใช้สำลีชุบน้ำที่คั้นจากใบสะระแหน่ หยอดที่รูจมูก<br>7.ใช้ไปทำน้ำมันหอมระเหยเพื่อใช้ในการทำสุคนธบำบัด<br>8.เป็นยารักษาโรคเกี่ยวกับต่อมไทรอยด์',
    plant: '<br>1.ใช้การปักชำ โดยเลือกกิ่งที่ไม่อ่อนหรือไม่แก่เกินไป<br>2.ปักจิ้มลงไปในแปลงเพาะชำหรือแปลงปลูกที่มีดินร่วนซุย ปักให้กิ่งเอนทาบกับดิน<br>3.รดน้ำให้ชุ่ม แต่ห้ามให้ถึงกับแฉะ<br>4.	โรยแกลบทับกลบดินเพื่อรักษาความชุ่มชื้นให้หน้าดิน ประมาณ 4-5 วันก็จะแตกใบ แตกยอดเลื้อยคลุมดิน<br>5.ต้นสะระแหน่ชอบดินร่วนซุยที่ระบายน้ำได้ดี และต้องการแสงสว่าง แต่ไม่ต้องการแดดที่ร้อนจัดจนเกินไป จะปลูกในที่ร่มหรือในที่แดดก็ได้<br>6.ควรรดน้ำให้ชุ่มอยู่เสมอ จะทำให้สะระแหน่เจริญเติบโตเร็วขึ้น'
  },
  {
    name: 'ตะไคร้ (Lemon grass)',
    image: 'https://www.nanagarden.com/picture/product/400/webp/255994.webp',
    benefit: '<br>1.ใช้เป็นยารักษาโรคหืด<br>2.แก้ปวดท้อง<br>3.ขับปัสสาวะ<br>4.ลดความดันสูง',
    plant: '<br>1.เริ่มจากการเตรียมดิน โดยใส่ปุ๋ยคอกหรือปุ๋ยหมักคลุกเคล้าให้เข้ากับดินขุดหลุมปลูก<br>2.นำพันธุ์ตะไคร้ที่เตรียมไว้ตัดใบออก ให้เหลือต้นยาว ประมาณ 30-40 เซนติเมตร<br>3.แช่น้ำประมาณ 5-7 วัน เพื่อให้รากงอก<br>4.รากที่แก่เต็มที่จะมีสีเหลืองเข้ม นำไปปลูกในแปลง วางต้นพันธุ์ให้เอียง 45 องศาไปด้านใดด้านหนึ่งแล้วกลบดิน<br>5.รดน้ำให้ชุ่ม หลังปลูกได้ประมาณ 30 วัน ก็ควรใส่ปุ๋ยสูตร 15-15-15 หรือ 46-0-0 อัตรา 50 กิโลกรัม/ไร่<br>6.ควรให้น้ำพอหน้าดินชื้น ประมาณ 1-2 วันจึงรดน้ำครั้งหนึ่ง<br>7.เก็บเกี่ยวเมื่อตะไคร้อายุประมาณ 90 วัน'
  },
]


app.get('/products', (req, res) => {
  res.status(200).json(products);
})

app.listen(PORT, (req,res) => {
    console.log('Sever is running...'+ PORT)
    
})